OpenFOAM-6-cantera-openmpi/tutorials/compressible/rhoCentralFoam/LadenburgJet60psi/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.001;

vertices
(
    ( 0 0 0)
    (30 0 0)
    ( 0  5 -0.008726655121)
    (30  5 -0.008726655121)
    ( 0 10 -0.017453310242)
    (30 10 -0.017453310242)
    ( 0  5  0.008726655121)
    (30  5  0.008726655121)
    ( 0 10  0.017453310242)
    (30 10  0.017453310242)
);

blocks
(
    hex (0 1 3 2 0 1 7 6) (60 10  1) simpleGrading (1 1 1)
    hex (2 3 5 4 6 7 9 8) (60 10  1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 2 6 0)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (1 3 7 1)
            (3 5 9 7)
        );
    }

    freestreamInlet
    {
        type patch;
        faces
        (
            (2 4 8 6)
        );
    }

    freestream
    {
        type patch;
        faces
        (
            (4 8 9 5)
        );
    }

    wedge1
    {
        type wedge;
        faces
        (
            (0 2 3 1)
            (2 4 5 3)
        );
    }

    wedge2
    {
        type wedge;
        faces
        (
            (0 1 7 6)
            (6 7 9 8)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
